app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `email` = 'candido.cimol@gmail.com'
 LIMIT 1
---
            $password = $this->request->getPost('password');

            $userModel = new UserModel();
            $userInfo = $userModel->where('email', $email)->first();