app/Controllers/ClientHome.php

    public function index()
    {
        $userModel = new UserModel();


        if (session()->has('loggedInUser')) {
            $loggedInUserId = session()->get('loggedInUser');
            $userInfo = $userModel->find($loggedInUserId);
            if ($userInfo['type'] == 'client') {


                $data = [
                    'title' => 'ClientHome',
                    'userInfo' => $userInfo,
                    'orderArray' => $this->ordersModel->findAll(),
                    'flavorArray' => $this->flavorModel->findAll(),
                    'edgeArray' => $this->edgeModel->findAll(),
                    'doughArray' => $this->doughModel->findAll(),
                ];

                return view('clientHome/index', $data);
            } else {
                return redirect()->to('admin');
            }
        } else {
            $data = [
                'orderArray' => $this->ordersModel->findAll(),
                'flavorArray' => $this->flavorModel->findAll(),
                'edgeArray' => $this->edgeModel->findAll(),
                'doughArray' => $this->doughModel->findAll(),
            ];
---
SELECT *
FROM `orders`
SELECT *
FROM `flavor`
SELECT *
FROM `edge`
SELECT *
FROM `dough`

    public function orderStatus(){
        $loggedInUserId = session()->get('loggedInUser');
        $status = $this->ordersModel->where('user_id', $loggedInUserId)->findAll();
---
SELECT *
FROM `orders`
WHERE `user_id` IS NULL