app/Controllers/Dashboard.php

    public function index()
    {

        $userModel = new UserModel();
        $loggedInUserId = session()->get('loggedInUser');
        $userInfo = $userModel->find($loggedInUserId);

        $data = [
            'title' => 'Dashboard',
            'userInfo' => $userInfo,
            'outputArray' => $this->movimentModel->where('type', 'input')->findAll(),
            'inputArray' => $this->movimentModel->where('type','output')->findAll(),
            'fullArray' => $this->movimentModel->findAll()
---
SELECT *
FROM `user`
WHERE `user`.`id` = '1'
SELECT *
FROM `moviment`
WHERE `type` = 'input'
SELECT *
FROM `moviment`
WHERE `type` = 'output'
SELECT *
FROM `moviment`