app/Controllers/Moviment.php

    public function index()
    {
        $userModel = new UserModel();
        $loggedInUserId = session()->get('loggedInUser');
        $userInfo = $userModel->find($loggedInUserId);
        $dados = [
            'title' => 'Moviments',
            'userInfo' => $userInfo,
            'moviments' => $this->movimentModel->orderBy('id', 'DESC')->findAll()
        ];
---
SELECT *
FROM `user`
WHERE `user`.`id` = '1'
SELECT *
FROM `moviment`
ORDER BY `id` DESC

    public function create() {
        $userModel = new UserModel();
        $loggedInUserId = session()->get('loggedInUser');
        $userInfo = $userModel->find($loggedInUserId);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '1'